##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [1]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인

import numpy as np
import pandas as pd

df = pd.read_csv('./data/titanic.csv')

print(df.head()) # 어떻게 생겼나 보기
print("============================================")
print(df.info()) # 기본 정보
print("============================================")
print(df.describe())
    # cabin 컬럼에 null값이 엄청 많고
    # 나이 컬럼에 null값이 좀 있고
    # Embarked 컬럼에도 null이 존재함
print("============================================")
df[df.duplicated()] # 중복값 확인

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
============================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
============================================
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
============================================

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

- 기초문제

In [2]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력

df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [3]:
# 2. 승객 나이의 평균 출력

print(df['Age'].mean())

29.69911764705882

In [4]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력

# 초안
# highestfare = df[df['Pclass'] == 1]['Fare'].max()

highestfare = df.loc[df['Pclass'] == 1, 'Fare'].max()
df[ (df['Pclass'] == 1) & (df['Fare'] == highestfare)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [5]:
# 4. 여성 승객의 수를 구하여 출력

(df['Sex'] == 'female').sum()

np.int64(314)

In [6]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력

# 초안
# df[df['Fare']>=50][['Name','Fare']]

# .loc[행 조건, 열 조건]
df.loc[df['Fare']>=50 ,['Name','Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [7]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력

minor_total = len( df[ df['Age'] < 18 ] )
minor_survived = df.loc[(df['Age'] < 18), 'Survived'].sum()
print( minor_survived / minor_total )

0.5398230088495575

In [8]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력

df.loc[ df['Pclass'] == 2 , 'Fare' ].mean()

np.float64(20.662183152173913)

In [9]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력

df.sort_values('Age', ascending = False)

# DataFrame.idxmax(axis=0, skipna=True) >>> 해당 axis 방향으로 최대인 행(열)의 인덱스를 반환
index1 = df['Age'].idxmax()
df.loc[index1, ['Age','Name']]

Age                                     80.0
Name    Barkworth, Mr. Algernon Henry Wilson
Name: 630, dtype: object

In [10]:
# 9. S 항구에서 탑승한 승객의 수를 출력

# num_C = (df['Embarked'] == "C").sum()
num_S = (df['Embarked'] == "S").sum()
# num_Q = (df['Embarked'] == "Q").sum()
# total = num_C + num_S + num_Q

# print(total)
print(num_S)

644

In [11]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력

condition1 = df['Pclass'] == 3 # 3등급 객실이며
condition2 = df['Sex'] == 'male' # 남성이며
condition3 = df['Survived'] == 1 # 생존자인가

len( df[condition1 & condition2 & condition3] )

47

- 고급문제

In [12]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

df_2grouped = df.groupby(['Pclass','Survived'])
df_2grouped['Age'].mean()

Pclass  Survived
1       0           43.695312
        1           35.368197
2       0           33.544444
        1           25.901566
3       0           26.555556
        1           20.646118
Name: Age, dtype: float64

In [13]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

df_sibsp3 = df[df['SibSp'] >= 3]
df_sibsp3.sort_values('Fare', ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.00,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.00,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.00,C23 C25 C27,S
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.55,NaN,S
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.55,NaN,S

In [14]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

df_sub = df[df['Age'].isna()]
# print(df_sub)

df_embarked = df_sub.groupby('Embarked')

df_embarked.size()

# for name,group in df_embarked:
#     print(name)     
#     display(group)

Embarked
C    38
Q    49
S    90
dtype: int64

In [15]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

condition1 = df['Age'] < 16
condition2 = df['SibSp'] == 0
condition3 = df['Parch'] == 0

df.loc[ condition1 & condition2 & condition3, ["Name","Sex","Survived"] ]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [16]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

condition1 = df['Pclass'] == 1

mean_val = df.loc[condition1, 'Fare'].mean()
print(mean_val)

condition2 = df.loc[condition1, 'Fare'] > mean_val

df.loc[condition1 & condition2, ['Name','Age','Fare']]

84.1546875

                                                  Name   Age      Fare
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN  146.5208
88                          Fortune, Miss. Mabel Helen  23.0  263.0000
118                           Baxter, Mr. Quigg Edmond  24.0  247.5208
195                               Lurette, Miss. Elise  58.0  146.5208
..                                                 ...   ...       ...
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  43.0  211.3375
802                Carter, Master. William Thornton II  11.0  120.0000
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  52.0   93.5000
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   NaN   89.1042
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667

[66 rows x 3 columns]

In [17]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

# DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
    # axis : {0: index / 1: columns} 결측치 제거를 진행 할 레이블
    # how : 'any' : 존재하면 제거 / 'all' : 모두 결측치면 제거
    # tresh : 결측값이 아닌 값이 몇 개 미만일 경우에만 적용시키는 인수
    # subset : dropna메서드를 수행할 레이블을 지정 >>> 특정 열(혹은 행)에서만 결측치를 탐색하도록 할 수 있음 goat..
    # inplace : 원본을 변경할지의 여부

df_dropna = df.dropna(subset=['Age','Pclass','Fare'])
print(df_dropna.info())
print("=============")

df_groupby = df_dropna.groupby('Pclass')

df_groupby['Fare'].mean(), df_groupby['Fare'].median()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Survived     714 non-null    int64
 2   Pclass       714 non-null    int64
 3   Name         714 non-null    object
 4   Sex          714 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        714 non-null    int64
 7   Parch        714 non-null    int64
 8   Ticket       714 non-null    object
 9   Fare         714 non-null    float64
 10  Cabin        185 non-null    object
 11  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 72.5+ KB
None
=============

(Pclass
 1    87.961582
 2    21.471556
 3    13.229435
 Name: Fare, dtype: float64,
 Pclass
 1    69.3000
 2    15.0458
 3     8.0500
 Name: Fare, dtype: float64)

In [18]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

# 항구별 평균 나이
df_groupby = df.groupby('Embarked')
print(df_groupby['Age'].mean())

# 승객 많은 거 누굴까
# len(df_groupby.get_group('C')), len(df_groupby.get_group('Q')), len(df_groupby.get_group('S'))
    # >>> size!
print(df_groupby.size())

# 생존율 계산
df_S = df_groupby.get_group('S')
print(df_S['Survived'].sum() / len(df_S))

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
Embarked
C    168
Q     77
S    644
dtype: int64
0.33695652173913043

In [19]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

condition1 = df['Sex'] == 'female'
condition2 = df['Age'] >= 30

df_survived = df.loc[condition1 & condition2, 'Survived']
print( df_survived.sum() / len(df_survived) )

0.8070175438596491

In [20]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

df1 = df
df1['altogether'] = df1['SibSp'] + df1['Parch']
# print(df1)

condition = df1['altogether'] >= 3

print( df1.loc[condition,'Survived'].sum() / len(df1.loc[condition]) )

0.34065934065934067

In [21]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력

df_dropna = df.dropna(subset=['Cabin'])
# print(df_dropna.info())

df_groupby = df_dropna.groupby(['Pclass','Survived'])
                            # print( df_groupby.size() )
                            # print( type( df_groupby.size() ) )
Series_Pclass = df_groupby.size()
                            # print(Series_Pclass)
                            # print(Series_Pclass.index)

for x, y in Series_Pclass.index:
    if y==0:
        factor0 = Series_Pclass[x,y]
    if y==1:
        factor1 = Series_Pclass[x,y]
        survival_rate = factor1 / (factor0 + factor1)
        print(f"{x}등급 승객들의 생존율은 {survival_rate}입니다.")

# (1) Series_Pclass.values를 해서 나온 리스트로 for문을 더 단순하게 만들 수 있었을 덧
# (2) 아니면 values 쓰지 말고, for x,y 대신
    # for i in range(1,4(혹은 len 이런 걸 쓰든))으로 하고,
        # factor0 = Series_Pclass[i,0],
        # factor1 = Series_Pclass[i,1]이라 했어도 됐을 것 같다. 그럼 줄 수 줄일 수 있었겠는데

1등급 승객들의 생존율은 0.6647727272727273입니다.
2등급 승객들의 생존율은 0.8125입니다.
3등급 승객들의 생존율은 0.5입니다.